{"keras_version": "1.2.2", "config": [{"config": {"border_mode": "same", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "nb_filter": 32, "batch_input_shape": [null, 32, 32, 3], "name": "convolution2d_1", "input_dtype": "float32", "nb_row": 3, "W_constraint": null, "activation": "linear", "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "linear", "nb_filter": 32, "b_regularizer": null, "name": "convolution2d_2", "nb_row": 3, "W_constraint": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"border_mode": "same", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "linear", "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "W_constraint": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activation": "linear", "nb_filter": 64, "b_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "output_dim": 128, "bias": true, "activity_regularizer": null, "input_dim": 2304, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"mode": 0, "trainable": true, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "name": "batchnormalization_1", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "output_dim": 43, "bias": true, "activity_regularizer": null, "input_dim": 128, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "class_name": "Sequential"}